siade/spec/fixtures/payloads/ants/found_siv.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <siv:rep_consulter_dossier
      xmlns:siv="http://siv.mi.fr/DefinitionsServices/2007-06"
    >
      <siv:control>
        <siv:code_partenaire>131614</siv:code_partenaire>
        <siv:code_miat>QSIV</siv:code_miat>
        <siv:date_envoi>2025-08-08T12:23:40+02:00</siv:date_envoi>
        <siv:type_operation>Consultation Dossier</siv:type_operation>
        <siv:numero_session
          >req_d8ad3bab-91fc-4ee9-a1af-9a0419e7c578</siv:numero_session
        >
        <siv:code_traitement>0</siv:code_traitement>
        <siv:code_operation>5078239</siv:code_operation>
        <siv:date_reception>2025-08-08T14:23:40+02:00</siv:date_reception>
        <siv:type_fichier_joint>xml</siv:type_fichier_joint>
      </siv:control>
      <siv:reponse>
        <siv:dossier>
          <siv:immatriculation>
            <siv:num_immat>TT-939-WA</siv:num_immat>
            <siv:date_prem_immat>2009-02-18</siv:date_prem_immat>
            <siv:date_att_immat>2009-02-18</siv:date_att_immat>
            <siv:code_type_immat>N</siv:code_type_immat>
            <siv:libelle_type_immat>Normale</siv:libelle_type_immat>
          </siv:immatriculation>
          <siv:vehicule>
            <siv:caracteristiques_techniques>
              <siv:marque_vehicule>PEUGEOT</siv:marque_vehicule>
              <siv:tvv>4H5FTF</siv:tvv>
              <siv:cnit>MPE3616V4590</siv:cnit>
              <siv:denomination_com>308</siv:denomination_com>
              <siv:vin>VF34H5FTF00231868</siv:vin>
              <siv:code_couleur>09</siv:code_couleur>
              <siv:libelle_couleur>BLANC</siv:libelle_couleur>
              <siv:pt>2145</siv:pt>
              <siv:ptac>2145</siv:ptac>
              <siv:ptra>3195</siv:ptra>
              <siv:pt_service>1577</siv:pt_service>
              <siv:ptav>1502</siv:ptav>
              <siv:categorie_ce>M1</siv:categorie_ce>
              <siv:genre_national>VP</siv:genre_national>
              <siv:carrosserie_ce>AF</siv:carrosserie_ce>
              <siv:carrosserie_national>CI</siv:carrosserie_national>
              <siv:num_reception>e2*2001/116*0362*07</siv:num_reception>
              <siv:type_reception>CE</siv:type_reception>
              <siv:cylindree>1598</siv:cylindree>
              <siv:puissance_nette_max>103</siv:puissance_nette_max>
              <siv:energie>ES</siv:energie>
              <siv:puissance_cv>9</siv:puissance_cv>
              <siv:places_assises>7</siv:places_assises>
              <siv:niveau_sonore>82</siv:niveau_sonore>
              <siv:vitesse>4350</siv:vitesse>
              <siv:co2>194</siv:co2>
              <siv:classe_environnement_ce
                >70/220*2003/76EURO4</siv:classe_environnement_ce
              >
            </siv:caracteristiques_techniques>
          </siv:vehicule>
          <siv:personne>
            <siv:nb_cotitulaires>0</siv:nb_cotitulaires>
            <siv:liste_personnes>
              <siv:personne>
                <siv:code_type_personne>TIT</siv:code_type_personne>
                <siv:libelle_type_personne>titulaire</siv:libelle_type_personne>
                <siv:identite_personne>
                  <siv:flag_pers_physique>oui</siv:flag_pers_physique>
                  <siv:nom_naiss>DUPONT</siv:nom_naiss>
                  <siv:prenom>JEAN</siv:prenom>
                  <siv:sexe>M</siv:sexe>
                  <siv:date_naissance>2000-01-01</siv:date_naissance>
                  <siv:lieu_naissance>PARIS</siv:lieu_naissance>
                  <siv:code_dep_naissance>75</siv:code_dep_naissance>
                  <siv:libelle_dep_naissance>PARIS</siv:libelle_dep_naissance>
                </siv:identite_personne>
                <siv:adresse_personne>
                  <siv:num_voie>12</siv:num_voie>
                  <siv:type_voie>AVENUE</siv:type_voie>
                  <siv:libelle_voie>DES CHAMPS</siv:libelle_voie>
                  <siv:code_postal>59000</siv:code_postal>
                  <siv:libelle_commune>LILLE</siv:libelle_commune>
                  <siv:pays>FRANCE</siv:pays>
                </siv:adresse_personne>
              </siv:personne>
            </siv:liste_personnes>
            <siv:acquisition>
              <siv:dca_date_ca>2008-11-28</siv:dca_date_ca>
              <siv:dca_date_enr_ca>2009-05-28</siv:dca_date_enr_ca>
              <siv:dca_code_type_ca>A</siv:dca_code_type_ca>
              <siv:dca_code_type_nd>N</siv:dca_code_type_nd>
              <siv:dca_qualite_acheteur>AUTO</siv:dca_qualite_acheteur>
            </siv:acquisition>
          </siv:personne>
        </siv:dossier>
      </siv:reponse>
    </siv:rep_consulter_dossier>
  </soapenv:Body>
</soapenv:Envelope>
